app/Livewire/Link/Index.php

select * from "links" where "links"."user_id" = 1 and "links"."user_id" is not null limit 10 offset 0
select count(*) as aggregate from "links" where "links"."user_id" = 1 and "links"."user_id" is not null
---
    public function paginatedlinks()
    {

        $links =  Auth::user()->links()->paginate(10);